#ifndef __shape__
#define __shape__

class shape{                //shape үндсэн класс тодорхойлолт
    protected:              //private хандалтын түвшинтэй
        float a;            //талын урт, радиус хадгалах хувьсагч
        char *name;         //нэр хадгалах хаяган хувьсагч 
    public:                 //public хандалтын түвшинтэй
        shape(float a);     //дүрсийн нэрийг хадгалах хаяган хувьсагч
        ~shape();           //устгагч функц зарлалт
        static int number;  //статик хувьсагч зарлалт. нийт хэдэн объект үүсэж, устаж байгааг тоолно
        static void number_ret();           //статик гишүүн өгөгдлийг хэвлэж харуулах функц
};
#endif 