#include<iostream>
#include<string.h>
using namespace std;
int count=0;                                            //static хувьсагч зарлаж байна. энэ нь нийт хэдэн удаа байгуулагч функц үүсгэгдэж байгааг тоолохоос гадна ажилчдыг дугаарлах үүрэгтэй
class employee{                                         //employee класс зарлаж байна
    private:                                            //private хандалтын түвшинтэй өгөгдөл функцуудыг зарлана
        char name[20];                                     //нэр хадгалах хүснэгтэн өгөгдөл зарлаж байна. 
        char alban_tushaal[20];                            //албан тушаал гэсэн бичвэрэн өгөгдөл хадгалах массив зарлаж байна
        float time;                                     //ажилласан цаг хувьсагч буюу гишүүн өгөгдөл зарлаж байна
        float zahirlin_tsalin_bodoh(void){              //захирлын цалин бодох функц
            return tsalin+=50000.0;                     //Цалин дээр захирлын цалингийн нэмэгдэлийг нэмж буцаана
        }              
                                               
    public:                                             //public хандалтын түвшинтэй өгөгдөл функцуудыг зарлана
        int number;                                     //number нэртэй гишүүн өгөгдөл зарлаж байна
        float tsalin;                                   //цалин нэртэй гишүүн өгөгдөл
        void show_data(void);                           //мэдээлэл дэлгэцэнд харуулах функц зарлаж байна
        float tsalin_bodoh(void);                       //цалин бодох үйлдэл хийх функц зарлалт
        float ajillasan_tsag_nemegduuleh(float x);      //ажилласан цагийг нэмэгдүүлэх үйлдэл хийнэ
        void copy(employee &s);                         //copy функц зарлалт. энэ нь ойн цоорхой үүсгэхээс сэргийлнэ
        void set_name(char s[]){                        //name нэртэй private хандалтын түвшинтэй гишүүн өгөгдөлд утга оноох функц
            strcpy(name, s);                            //нөөцөлсөн санах ойд S хаяган хувьсагчийн зааж байгаа хүснэгтийг оруулна
        }
        char *get_name(void){                           //name нэртэй private хандалтын түвшинтэй гишүүн өгөгдөлд хандах функц
            return name;                                //утга буцаана
        }
        void set_alban_tushaal(char *s){                //албан тушаал нэртэй private хандалтын түвшинтэй гишүүн өгөгдөлд утга оноох функц
            strcpy(alban_tushaal, s);                   //албан тушаалд S хаяган хувьсагчийн зааж байгаа char хүснэгтийг оруулна
        }
        char *get_alban_tushaal(void){                  //албан тушаал нэртэй private хандалтын түвшинтэй гишүүн өгөгдөлд хандах функц
            return alban_tushaal;                       //албан тушаал буцаана
        }
        void set_ajillasan_t(float x){                  //ажилласан цаг нэртэй private хандалтын түвшинтэй гишүүн өгөгдөлд утга оноох функц
                time=x;                                 //ажилласан цаг гишүүн өгөгдөлд утга онооно
        }

        float get_ajillasan_t(void){                    //ажилласан цаг нэртэй private хандалтын түвшинтэй гишүүн өгөгдөлд хандах функц
            return time;                                //ажилласан цаг буцаана.
        }
        employee(){                                     //employee анхдагч байгуулагч функц тодорхойлж байна
            cout << "created: " << count++ <<"\n";      //хэдэн байгуулагч функц үүсгэгдэж байгааг тоолох тоолуур
            number=count;                               //дугаарт тоолуур оноож өгч байна. ингэснээр шууд дугаарлагдана                           
            name[20] = {NULL};                         //5 хэмжээтэй санах ой нөөцөлж байна
            alban_tushaal[20] = {NULL};                 //20 хэмжээтэй санах ой нөөцөлсөн name-д NULL ийг оруулж өгнө 
            time = 0;
        }
        employee(char *a, char *b, float x){            //параметртэй байгуулагч функц тодорхойлж байна
            count++;                                    //байгуулах бүрд cout тоолуурын гишүүн нэмэгдэнэ
            number=count;                               //дугаарт тоолуур оноож өгч байна. ингэснээр шууд дугаарлагдана  
            set_name(a);                                //name -д а хүснэгтэд байгаа үгийг хадгална
            set_alban_tushaal(b);                       //албан тушаалд b хүснэгтэд байгаа үгийг хадгална
            set_ajillasan_t(x);                         //ажилласан цаг тохируулах функцийг дуудаж private хандалтын түвшинтэй гишүүн өгөгдөлд утга онооно
        }
        ~employee(){                                    //устгагч функц тодорхойлж байна
            cout << "deleted"<< --count <<endl;         //нийт хэдэн удаа байгуулагч функц устгагдсаныг харуулна
        }
};

void employee::show_data(){                             //show data функцийн тодорхойлолт хийж байна
    cout<<" dugaar: "<<number<<endl;                    //дугаарт хадгалсан мэдээллийг хэвлэж харуулна
    cout<<" ner: "<<get_name()<<endl;                   //нэр массивт хадгалсан мэдээллийг хэвлэж харуулна
    cout<<" alban tushaal: "<<get_alban_tushaal()<<endl;//албан тушаал массивт хадгалсан өгөгдлийг хэвлэж харуулна
    cout<<" ajillasan tsag: "<< time <<endl;            //ажилласан цагийг хэвлэж харуулна
    cout<<" tsalin: "<< tsalin;                         //цалин хэвлэж харуулна
    cout<<endl<<endl;                                   //мөр шилжүүлнэ
}
float employee::tsalin_bodoh(){                         //цалин бодох функцийн тодорхойлолт
    float ts=6500.0;
    tsalin =time*ts;                                    //цалинг цагийн 6500 аар тооцон бодохын тулд ts зарлаж өгсөн
    if(strcmp(alban_tushaal, "zahiral") == 0){          //албан тушаал нь захирал гэсэн үгтэй адилхан байна уу гэдгийг шалгана                                //цалинг бодохдоо ажилласан цагийг тогмолоор үржүүлж гаргана
        return zahirlin_tsalin_bodoh();                 //захирлын цалин бодох функцийг дуудаж ажиллуулна 
    }else{                                              //эсрэг тохиолдолд ажилчдын цалин бодно. ажилласан цагийг тогтмолоор шууд үржүүлээд ямар нэгэн нэмэгдэл байхгүй
        return tsalin;                                  //цалинг буцаана
    }                        
}
float employee::ajillasan_tsag_nemegduuleh(float x){    //ажилласан цаг нэмэгдүүлэх функц тодорхойлж байна
    if(x<24 && x>0){                                    //параметрээс орж ирж буй утга 0ээс24 ын хоорон байна уу шалгах
        time += x;                                      //нөхцөл биелэсэн тохиолдолд ажилласан цагийг нэмэгдүүлэх үйлдэл хийнэ
        return time;                                    //ажилласан цагийг буцаана                        
    }else{   
        cout<<"error"<<endl;                            //эсрэг тохиолдолд Error гэсэн утга хэвлэж харуулж ямар нэгэн нэмэгдэл орохгүй
        return time;                                    //time утга буцаана
    }
}
void employee::copy(employee &s){                       //copy функц тодорхойлж байна
    strcpy(name,s.name);                                    //name-д employee s-ийн нэрийг хуулна
    strcpy(alban_tushaal,s.alban_tushaal);                     //албан тушаал-д employee s-ийн албан тушаалыг хуулна
    time=s.time;                                        //employee s-ийн ажилласан цагийг хуулна
    tsalin=s.tsalin;                                    //цалинг хуулна

}
main(){
    int i;                                              //i тоолууран хувьсагч зарлаж байна
    float o;                                            //3 ажилчдын хүснэгт үүсгэж байна. анхдагч байгуулагчийн тусламжтайгаар
    employee c[3];
    for(i=0;i<3;i++){                                   //давталт гүйлгэнэ. 0ээс 3 хүртэл
        char name[20],ATu[20];                          //давталт гүйх болгонд name ATu массив үүсгэгдэнэ
        float k;                                        //ажилласан цагийг гараас авах хувьсагч зарлалт
        cout<<c[i].number<<endl;                        //ажилчны дугаарыг хэвлэж харуулна
        cout<<"name: ";                                 //name: гэж хэвлэж харуулна
        cin>>name;                                      //name массивт гараас утга авна
        c[i].set_name(name);                            //set_name тусламжтайгаар name-д гараас авсан хүснэгтийн хэмжээтэй санах ой үүсгэгдэж хадгалагдана
        cout<<"alban tushaal: ";                        //alban_tushaal: гэж хэвлэж харуулна
        cin>>ATu;                                       //ATu массивт гараас утга авна
        c[i].set_alban_tushaal(ATu);                    //set_alban_tushaal тусламжтайгаар alban_tushaal-д гараас авсан хүснэгтийн хэмжээтэй санах ой үүсгэгдэж хадгалагдана
        cout<<"ajillasan tsag: ";                       //ajillasan tsag: гэж хэвлэж харуулна
        cin>>k;                                         //k хувьсагчид гараас утга авна
        c[i].set_ajillasan_t(k);                        //set_ajillasan_t функцийн тусламжтайгаар ажилласан цаг private хандалтын түвшинтэй гишүүн өгөгдөлд утга оруулна
        c[i].tsalin_bodoh();                            //ажилчны цалинг бодохын тулд энэ функцийг дуудаж байна
    }
    for(i=0;i<3;i++){                                   //For давталт 0-3 хүртэл гүйнэ
        c[i].show_data();                               //бүх ажилчдын мэдээллийг хэвлэж харуулна
    }
    
    // cout<<"ajillasan tsag nemegduuleh"<<endl;
    // cout<<"ajilcnii dugaar: ";
    // cin>>d;
    // cout<<"ajillasan tsag: ";
    // cin>>o;
    // c[d].ajillasan_tsag_nemegduuleh(o);

    for(i=0;i<3;i++){                                   //давхар давталт гүйнэ
        for(int j=0;j<2;j++){
            if(c[j].tsalin>c[j+1].tsalin){              //0 индекс дэх ажилчин 1 индекс дэх ажилчны цалингаас их байна уу гэдгийг шалгах
                employee tmp;                           //нөхцөл биелэж байвал байрыг copy функцийн тусламжтайгаар солих үйлдэл хийнэ
                tmp.copy(c[j]);
                c[j].copy(c[j+1]);
                c[j+1].copy(tmp);
            }
        }
    }
    for(i=0;i<3;i++){                                   //ажилчдын мэдээллийг хэвлэхийн тулд for давталт гүйлгэж байна 
        c[i].show_data();                               //хэвлэж харуулах функц дуудаж байна.
    }
}
