#include<iostream>

using namespace std;

void swap(int *a,int *b){   //swap нэртэй утга буцаахгүй функц зарлаж байна. параметрын хувьд адил int төрөл байна
    int tmp;                //tmp нэртэй int төрөлтэй хувьсагч зарлаж өгнө. 2 хувьсагчийн байрыг солиход хэрэгтэй
    tmp=*a;                 //tmp буюу хоосон хувьсагчид a хаяган хувьсагчийн хадгална
    *a=*b;                  // a хаяган хувьсагчид b хаяган хувьсагчийг хадгалж байна 
    *b=tmp;                 // b хаяган хувьсагчид а-гийн утга хадгалагдаж буй tmp-ийг хадгалж байна
}

main(){
    int *p,a=10,b=20;       //int төрөлтэй p хаяган хувьсагч, a=10 b=20 анхны утгатай хувьсагч зарлаж өгнө
    swap(a,b);              //swap функцыг дуудаж байна.
    cout<<a<<b;             // функц ажиллаад a b хоёр тооны байр солигдсон эсэхийг шалган хэвлэж байна
    }