#include<iostream>

using namespace std;

void exchange(int &a,int &b){   //exchange нэртэй утга буцаадаггүй int төрлийн a b заалтан хувьсагч параметртэй функц зарлаж байна
    int tmp;                    //int төрлийн tmp хувьсагч зарлаж байна. 2 хувьсагчийн байрыг солиход ашиглана
    tmp=a;                      //tmp-д а хадгалж байна
    a=b;                        //a=b гэснээр а хувьсагч b тоог заана
    b=tmp;                      //b заалтан хувьсагч tmp-ын хадгалсан тоог заана
}

int main(){
    int a=10,b=20;              //int төрөлтэй а=10 b=20 анхны утгатай хувьсагч зарлаж байна
    exchange(a,b);              //функцыг дуудаж ажиллуулж байна
    cout<<a<<b;                 //хэвлэж байна
}